{
  "jokes": [
    {
      "text": "A black cat and a white cat falls into the water, what did the black cat said to the white cat?\n\nMeow"
    },
    {
      "text": "Those black cats better not cross my path. I'm not superstitious.\n\nJust racicst"
    },
    {
      "text": "What's a cat's favorite color?\n\nPurr-ple"
    },
    {
      "text": "When is it bad luck to have a black cat follow you?\n\nWhen you are a mouse"
    },
    {
      "text": "The teacher asked Jimmy: Why is your cat at schoold today Jimmy?\n\nJimmy replied(crying), because I heard my daddy tell mu mommy, Ima eat that pussy once Jimmy leaves for school today!"
    },
{
      "text": "I identify as Schrodinger's cat.\n\nMy pronouns are is/isn't"
    },
{
      "text": "A dyslexic cat broke into a hen house\n\nIt was an absolute fluster cluck"
    },
{
      "text": "If all dogs go to heaveb, where do cats go?\n\nPurrrgatory"
    },
{
      "text": "What do you call a pile of cats?\n\nA meowtain!"
    },
{
      "text": "What do you get when you cross a cat with a dark horse?\n\nKitty Perry!"
    },
{
      "text": "Why can’t cats play poker in the jungle?\n\nToo many cheetahs!"
    },
{
      "text": "Why do cats always get their way?\n\nThey’re purr-suasive!"
    },
{
      "text": "How do we know the Earth isn’t flat?\n\nIf it were, cats would have already pushed everything off the edge!"
    },
{
      "text": "I think my cat might be a communist.\n\nHe won't shut up about Mao"
    },
{
      "text": "What sports do cats play?\n\nHairball."
    },
{
      "text": "What did the cat say when he lost all his money?\n\nI'm paw!"
    },
{
      "text": "What do cats like to eat on a hot day?\n\nA mice-cream cone."
    },
{
      "text": "What do you call a dog with no legs?\n\nIt doesn’t matter, he still won’t come when you call."
    },
{
      "text": "Why wasn’t the dog a smooth talker?\n\nBecause all he ever said was “Rough, Rough”"
    },
{
      "text": "What do you call a magic dog?\n\nA labra-cadabra-dor"
    },
{
      "text": "Why did the poor dog chase his own tail?\n\nHe was trying to make both ends meet!"
    },
{
      "text": "What do you get when you cross a dog and a calculator?\n\nA friend you can count on."
    },
{
      "text": "What do dogs do after they finish obedience school?\n\nThey get their masters."
    },
{
      "text": "What is called when a cat wins a dog show?\n\nA cat-has-trophy."
    },
{
      "text": "Which dog always knows what time it is?\n\nA watch dog."
    },
{
      "text": "Why do dogs make terrible dancers?\n\nBecause most of them have 2 left feet."
    },
{
      "text": "How do you stop your dog from barking in your front yard?\n\nPut him in your backyard"
    },
{
      "text": "What do you get if you cross a dog with a phone?\n\nA golden receiver"
    },
{
      "text": "What do you call a cowardly dog?\n\nA golden retreater."
    },
{
      "text": "How does a Japanese chihuahua say hello?\n\nKonichihuahua"
    },
{
      "text": "When you cross an aggressive dog with a computer, what do you get?\n\nA lot of bites"
    },
{
      "text": "What did Darth Vader's dog say to Luke's dog?\n\nCome on! Join the bark side."
    },
{
      "text": " What do you call a sleeping Rottweiler?\n\nWhatever you want, but do it silently."
    },
{
      "text": "When a dog has a fever, what should you feed him?\n\nMustard—it’s the best thing for hot dogs."
    },
{
      "text": "What did lazy cat said to the other cat: I am so good at sleeping.I can do it with my eyes closed."
    },
{
      "text": "Scientists have finally discovered exactly how much sleep a cat needs.\n\nJust five minutes more."
    },
{
      "text": "All cats would love to be paid to sleep.It would be their dream job."
    },
{
      "text": "How does a lawyer sleep?\n\nFirst he lies on one side and then on the other."
    },
{
      "text": "I burned 2000 calories today. I fell asleep while baking pizza in the oven."
    },
{
      "text": "Why are mountains always sleepy?\n\nBecause they nEverest."
    },
{
      "text": "Someone called me lazy today\n\nI almost replied..."
    },
{
      "text": "I dated a cat with a lazy eye once.\n\nIt turns out she was seeing someone else on the side"
    },
{
      "text": "I hate when my owner gets mad at me for being lazy\n\nIt’s not like I did anything"
    },
{
      "text": "What do you call a country full of lazy cats?\n\nA procrastination"
    },
{
      "text": "What do you call a fat cat with 3 teeth and a lazy eye?\n\nNames."
    },
{
      "text": "My laziness is like the number 8.\n\nOnce it lies down, itbecomes infinite"
    },
{
      "text": "What is cat's favorite type of dog?\n\nA hotdog!"
    },
{
      "text": "What is cats favorite time to eat?\n\nAnytime"
    },
{
      "text": "Where does a cat go when it loses its tail?\n\nThe re-tail store!"
    },
{
      "text": "What do you call a cat wearing shoes?\n\nA puss in boots!"
    },
{
      "text": "What’s a mouse’s favourite game?\n\nHide and squeak"
    },
{
      "text": "What do you call a group of Middle Eastern mice?\n\nUnited Arab Emi-rats"
    },
{
      "text": "Why can’t cats work on the computer?\n\nThey get too distracted chasing the mouse around."
    },
{
      "text": "Why are mice scared of swimming in the water?\n\nBecause of all the catfish in it!"
    },
{
      "text": "Why do mice stay inside when the sky is overcast with clouds?\n\nBecause it might rain cats and dogs"
    },
{
      "text": "Why was the mouse laughing so hard at the mice joke?\n\nBecause he was a-moused"
    },
{
      "text": "What did it feel like for Mickey when he first laid eyes on Minnie?\n\nHe fell in glove at first sight"
    },
{
      "text": "What’s gray, has big ears, and a trunk?\n\nA mouse on vacation."
    },
{
      "text": "What do you call a mouse that doesn’t walk, drink, or eat?\n\nA computer mouse."
    },
{
      "text": "Two mice chewing on a film roll\n\nOne of them goes: I think the book was better."
    },
{
      "text": "Mouse: Hey Snake, what are you up to tonight? Snake: I’m meeting my soulmate Mouse: Oh wow, that’s amazing. How do you know it’s your soulmate?Snake: You misheard me. I said I’m eating mice, whole, mate."
    },
{
      "text": "What did the exterminator say when he got fired?\n\nI'm not going to be a mice guy anymore."
    },
{
      "text": "Which mouse was a Roman emperor?\n\nJulius Cheeser."
    },
{
      "text": "A black cat and a white cat falls into the water, what did the black cat said to the white cat?\n\nMeow"
    },
{
      "text": "Those black cats better not cross my path. I'm not superstitious.\n\nJust racicst"
    },
{
      "text": "When is it bad luck to have a black cat follow you?\n\nWhen you are a mouse"
    },
{
      "text": "I identify as Schrodinger's cat.\n\nMy pronouns are is/isn't"
    },
{
      "text": "I think my cat might be a communist.\n\nHe won't shut up about Mao"
    },
{
      "text": "What do you call a pile of cats?\n\nA meowtain!"
    },
{
      "text": "What do cats like to eat on a hot day?\n\nA mice-cream cone."
    }
  ]
}